const rgroupE = {
    name: [
        "Аллегро(2.0)",
        "Аллегро XL(2.5)",
        "АСТРА",
        "Баблс",
        "Берлин(2.0)",
        "Берлин XL(2.5м)",
        "Берлин Шайн",
        "Бетти",
        "Блумен",
        "Дублин",
        "Каир",
        "Меланж",
        "Паласс",
        "Палетте",
        "Пап",
        "Пейсли",
        "Плейн",
        "Рондо",
        "Страйпс",
        "Фловербед",
        "Шантунг",
        "Ганни(Зебра)",
        "Симпл(Зебра)",
    ],
    setKat() { return "E" }
};

const rgroup1 = {
    name: [
        "Ажур",
        "Аллегро XXL(3.0)",
        "АЛЛЕГРО ЛЁН",
        "АЛЛЕГРО ПЕРЛ",
        "БАМБУК САТИН",
        "БАМБУК ФОКУС",
        "БЕРЛИН Б/О (2.0)",
        "ВЕРОНА",
        "ГАНА",
        "ДУБЛИН Б/О",
        "ИВИ",
        "ИТО САТИН",
        "ИТО ФОКУС",
        "КОФЕ САТ",
        "ЛИЛЛИ САТИН",
        "ЛИЛЛИ ФОКУС",
        "МИРАКЛ",
        "ОЛИВА САТИН",
        "ОЛИВА ФОКУС",
        "ПАЛЕРМО",
        "САЙПАН(2.4)",
        "СКАЙ САТИН",
        "СКАЙ ФОКУC",
        "СОНАТА",
        "СПРИНГ",
        "СПРИНГ САТИН",
        "СПРИНГ ФОКУС",
        "ТВИГ",
        "ТРИУМФ",
        "ФЛЁР",
        "БАБОЧКИ(Зебра)",
        "ВЕГА(Зебра)",
        "ГЛОС(Зебра)",
        "ГРАНАДА(Зебра)",
        "ИБИЦА(Зебра)",
        "КАСКАД(Зебра)",
        "ЛАТТЕ(Зебра)",
        "НАТУРАЛ(Зебра)",
        "СТРИП(Зебра)",
    ],
    setKat() { return 1 }
};

const rgroup2 = {
    name: [
        "АДОРА",
        "АЛЛЕГРО Б/О(2.0)",
        "АЛЛЕГРО Б/О XXL(3.0)",
        "АМАЛИЯ",
        "АРАБЕСКА",
        "БЕРЛИН СИЛЬВЕР(2,0)",
        "БЕРЛИН СИЛЬВЕР XL(2.5)",
        "БОСТОН",
        "БУКЛЕ",
        "БУШ",
        "ВАЛЕНСИЯ Б/O",
        "ГАЛАКТИКА",
        "ГАРДЕН",
        "ДАМАСК",
        "ДЖУНГЛИ",
        "ДУБЛИН СИЛЬВЕР XL(2.5)",
        "КАЛИФОРНИЯ",
        "КАПЕЛЛИ",
        "КРИСТАЛЛ",
        "ЛИМА(2.4)",
        "ЛИНО",
        "МАГЕЛЛ",
        "МАДР",
        "МИЛАН Б/О",
        "МИРАКЛ Б/О",
        "МИРАНДА",
        "НЕЛЬКЕ",
        "ОРЕГОН",
        "ПИЕТРА",
        "ПРИЗМА",
        "САВАН",
        "СИЕС",
        "ТУН",
        "ЭЛЕГИЯ",
        "МЕТАЛЛИК Б/О(Зебра)",
        "ОМБРЕ(Зебра)",
        "СЕВИЛЛА(Зебра)",
        "ТОЛЕДО(Зебра)",
    ],
    setKat() { return 2 }
}

const rgroup3 = {
    name: [
        "ГАЛАКТИКА Б/О",
        "ДАВОС СИЛЬВЕР",
        "ДЖУНГЛИ Б/О",
        "ЛИМА Б/О(2.4)",
        "ЛИНО Б/О",
        "МИРАНДА Б/О",
        "МОДЕЛЛО",
        "ОМЕГА XXL FR(3.0)",
        "ПАРМА Б/О(2.4)",
        "РАМЕТТО",
        "РУМБА(2.5)",
        "САЙПАН СИЛЬВЕР(2.15)",
        "СКРИН XXL(3.0) 5%",
        "СПЛЭШ",
        "ФИОРИ",
        "ЭКО",
    ],
    setKat() { return 3 }
};


const rgroup4 = {
    name: [
        "БОСТОН Б/О",
        "ГОА",
        "КЛАУДИА",
        "ЛАУРА",
        "ОМЕГА Б/О XXL FR(3.0)",
        "ПОРТО Б/О(2.4)",
        "ПОРТО ПЕРЛ(2.4)",
        "СКРИН СИЛЬВЕР НГ 5 %",

    ],
    setKat() { return 4 }
};


const rgroup5 = {
    name: [
        "АФРИКА Б/О",
        "БОМБЕЙ ",
        "БОНН Б/О ",
        "ВИНТАЖ ",
        "ГОА Б/О ",
        "КАННЫ Б/О ",
        "КЛАУДИА Б/О ",
        "РИНГО ",
        "ШАДЕ Б/О",
    ],
    setKat() { return 5 }
};



const igroup0 = {
    name: ["Стандарт 0225"],

    setKat(korob) {
        if (korob === "white") return "А";
        if (korob === "color") return "Д";
        if (korob === "lamin") return "И";
    },

};

const igroup1 = {
    name: [
        "Стандарт 0120",
        "Стандарт 1606",
        "Стандарт 1852",
        "Стандарт 1908",
        "Стандарт 2259",
        "Стандарт 23",
        "Стандарт 2406",
        "Стандарт 2746",
        "Стандарт 2871",
        "Стандарт 3204",
        "Стандарт 3209",
        "Стандарт 3458",
        "Стандарт 3499",
        "Стандарт 188",
        "Стандарт 4059",
        "Стандарт 4063",
        "Стандарт 4077",
        "Стандарт 4082",
        "Стандарт 4158",
        "Стандарт 4261",
        "Стандарт 490",
        "Стандарт 491",
        "Стандарт 5150",
        "Стандарт 5173",
        "Стандарт 5608",
        "Стандарт 5713",
        "Стандарт 5850",
        "Стандарт 5853",
        "Стандарт 7005",
        "Стандарт 7013",
        "Стандарт 7122",
        "Стандарт 7125",
        "Стандарт 50",
        "Стандарт 50/48",
        "Стандарт 7128",
        "Стандарт 7255",
        "Стандарт 7256",
        "Стандарт 7257",
        "Стандарт 7258",
    ],
    setKat(korob) {
        if (korob === "white") return "Б";
        if (korob === "color") return "Е";
        if (korob === "lamin") return "К";
    },
};

const igroup2 = {
    name: [
        "Замша 2549",
        "Перфорация 0225П",
        "Перфорация 1908П",
        "Перфорация 2259П",
        "Перфорация 7005П",
        "Перфорация 7125П",
        "Перламутр 2303",
        "Перламутр 2307",
        "Перламутр 2311",
    ],
    setKat(korob) {
        if (korob === "white") return "В";
        if (korob === "color") return "Ж";
        if (korob === "lamin") return "Л";
    },
}

const igroup3 = {
    name: ["Классик 9002",
        "Люкс 7505",
        "Люкс 7525",
        "Люкс 7528",
        "Люкс 7536",
        "Под дерево 6009",
        "Под дерево 6010",
        "Под дерево 6012",
        "Под дерево 6013",
        "Под дерево 6015",
        "Под дерево 6016",
    ],
    setKat(korob) {
        if (korob === "white") return "Г";
        if (korob === "color") return "З";
        if (korob === "lamin") return "М";
    },
}

let groupsR = [rgroupE, rgroup1, rgroup2, rgroup3, rgroup4, rgroup5, ];
let groupsI = [igroup0, igroup1, igroup2, igroup3];